<script setup>
    useHead({
        title: "站点协议"
    });

    const behaviors = [
        "访问阅读页",
        "发表评论",
        "进行与账号相关的操作"
    ];
</script>

<template>
    <coco-widget title="站点协议">
        <article class="novel-text">
            <p>本《站点协议》仅适用于本站：<em>{{ $config.public.title }}</em>，请仔细阅读本协议以更好地了解如何使用本站的功能与服务。一旦您选择继续浏览本站，即表示您同意我们按照本协议使用和处理您的相关信息，同时受到对等的限制与约束。如果您的行为违反了本协议的内容，我们将立刻终止相关授权，并保留追究责任的权利。</p>
            <p>此外，我们可能会随时对本协议进行修订，您将自动同意本协议的更新，或是拒绝变更并停止浏览本站。</p>
            <h2>版权声明</h2>
            <blockquote>
                <p>本网站的所有文章除特别声明外，转载均需经过作者本人同意；文章内容仅供个人交流用，禁作商业用途。</p>
            </blockquote>
            <h2>隐私政策</h2>
            <p>本站仅在以下情况收集个人信息：</p>
            <p v-for="text, i in behaviors">
                <strong class="text-gray">{{ i + 1 }}.</strong> 用户<em>{{ text }}</em>时{{ i === behaviors.length - 1 ? "。" : "；" }}
            </p>
            <p>本站收集用户的 IP 地址，以用于检测恶意访问、爬取、DDOS 攻击等情况并作相应的防御；同时，在阅读页根据 IP 地址与访问时间统计并展示阅读量。</p>
            <p>在发表评论时，评论者的邮箱不会被公开展示，仅返回 <code>md5</code> 结果。</p>
            <p>在存储密码时，本站采用了不可逆算法，包括本人在内的任何人都无法获取密码明文。</p>
            <p>本站<em>不使用</em>第三方收集与统计服务，且<em>不会向</em>任何其他公司、组织或个人共享您的隐私信息。</p>
            <h2>免责声明</h2>
            <p>对于本站引用的所有外部素材，<coco-link :to="{ name: `borrowing` }">借物表</coco-link>中都进行了明确的标注。如果它们侵犯了您的权益，请立即联系我们以及时地删除。</p>
            <p>本站存在一些指向其他网站的链接，我们将不对这些网站的内容或行为负责，请自行判断它们的安全性。</p>
        </article>
    </coco-widget>
</template>